# FabricationConnectorInfo Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConnectorInfo Class
Members See Also
---
Fabrication connector information.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class FabricationConnectorInfo : IDisposable
```

Visual Basic
---
```text
Public Class FabricationConnectorInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FabricationConnectorInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FabricationConnectorInfo
# See Also
FabricationConnectorInfo Members
Autodesk.Revit.DB Namespace